[
   {
        "title": "Welcome",
        "route": "/",
        "subtitle" : "Welcome to my portfolio website!",
        "p1" : "To get started, please use the navigation header at the top of the page to explore different sections of my site.",
        "p2" : "You'll find an About page where you can learn more about me and my background, a Projects page where you can browse through my work, and a Contact page where you can get in touch with me.",
        "p3" : "Thank you for visiting, and I hope you enjoy your time on my site!"
    },{
        "title": "About",
        "route": "/about",
        "inNavBar": true,
        "subtitle" : "Who I am!",
        "p1" : "I am a full-stack software engineer with a passion for web development.",
        "p2" : "My expertise in front-end technologies such as Java, Javascript, React and Next.js, back-end technologies such as SQL and MongoDB, and API design has enabled me to create websites that provide complex services in an easily accessible format.",
        "p3" : "I'm always striving to learn and grow, and ready to take on any new projects.",
        "p4" : "Feel free to reach out if you have any questions!"
    },{
        "title": "Projects",
        "route": "/projects",
        "inNavBar": true,
        "subtitle" : "What I've Done!",
        "p1" : "Here, you'll find a collection of my most recent projects.",
        "p2" : "Take your time to explore each one, and don't hesitate to reach out if you have any questions or feedback.",
        "p3" : "I hope these projects inspire and excite you as much as they do me!"

    },{
        "title": "Contact",
        "subtitle" : "How To Reach Me!",
        "route": "/contact",
        "inNavBar": true,
        "p1" : "If you have any questions, feedback, or collaboration ideas, I would love to hear from you.",
        "p2" : "Alternatively, you can find links to my GitHub and LinkedIn profiles below.",
        "p3" : "Thank you for your interest, and I look forward to hearing from you!"
    },{
        "title": "404 Error",
        "route": "/404"
    },{
        "title": "500 Error",
        "route": "/500"
    }
]